{
    "en":{
        "title": "Hi! I'm, Eduardo. ",
        "subtitle": "I build websites.",
        "author": "Eduardo Sanchez Hidalgo Urias",
        "version": "1.0",
        "description": "<p>This is my portfolio website where you can see my experience as a <strong>WordPress developer</strong> and a few of the projects I worked on.</p>",
        "projects": {
            "sectionTitle": "Projects",
            "content": [
                {
                    "id": 1,
                    "title": "PartySlate",
                    "description": "PartySlate already had a blog, but they wanted a fresh look and a better experience for their content team — that’s where I came in. I helped them revamp their blog by integrating a brand-new WordPress setup with both their main website and their legacy blog (also on WordPress). The project involved building custom Gutenberg blocks and templates using ACF, implementing GraphQL API calls for interactive widgets, and playing with a few other neat WordPress tricks. It was a fun challenge that blended creativity with solid engineering.",
                    "image": {
                        "src": "https://www.partyslate.com/best-of/",
                        "alt": "Website Uno",
                        "caption": "This is a caption for the first item."
                    }
                },
                {
                    "id": 2,
                    "title": "PalTech",
                    "description": "I built the PalTech website using WordPress, starting from their custom PSD designs. They handed me beautifully crafted layouts for every page, and I translated those into reusable modules to bring the templates to life. The project was not just about coding — it was about turning an elegant design into a fully functional site. It was genuinely fun to work on a build with such thoughtful design behind it.",
                    "image": {
                        "src": "./src/assets/website-dos.png",
                        "alt": "Website Dos",
                        "caption": "This is a caption for the second item."
                    }
                },
                {
                    "id": 3,
                    "title": "All Wheather",
                    "description": "<p>This was a challenging project that required strong teamwork.</p><p>I was primarily responsible for building most of the front end, while also contributing to some backend tasks. I developed custom templates for various post types using ACF, and integrated libraries like jQuery and Masonry to handle dynamic layouts. It was a great opportunity to blend functionality with a smooth user experience.</p>",
                    "image": {
                        "src": "./src/assets/website-tres.png",
                        "alt": "All Wheather Website",
                        "caption": "This is a caption for the third item."
                    }
                }
            ]
        },
        "jobs": {
            "sectionTitle": "Experience",
            "content": [
                {
                    "id": 1,
                    "title": "Item One",
                    "description": "This is the first item in the list.",
                    "startYear": "2020",
                    "endYear": "2021",
                    "image": {
                        "src": "",
                        "alt": "",
                        "caption": ""
                    }
                },
                {
                    "id": 2,
                    "title": "Item Two",
                    "description": "This is the second item in the list.",
                    "startYear": "2020",
                    "endYear": "2021"
                },
                {
                    "id": 3,
                    "title": "Item Three",
                    "description": "This is the third item in the list.",
                    "startYear": "2020",
                    "endYear": "2021"
                }
            ]
        }
    },
    "es": {
        "title": "¡Hola! Soy Eduardo.",
        "subtitle": "Construyo sitios web.",
        "author": "Eduardo Sánchez Hidalgo Urías",
        "version": "1.0",
        "description": "Este es mi sitio web de portafolio donde puedes ver mi experiencia como desarrollador de WordPress y algunos de los proyectos en los que he trabajado.",
        "projects":{ 
            "sectionTitle": "Proyectos",
            "content": [
                {
                    "id": 1,
                    "title": "PartySlate",
                    "description": "PartySlate ya tenía un blog, pero querían renovarlo y ofrecer una mejor experiencia a su equipo editorial — y ahí entré yo. Les ayudé a re-construir su blog desde cero, integrando una nueva instalación de WordPress con su sitio principal y su blog anterior (también en WordPress). El proyecto incluyó la creación de bloques personalizados de Gutenberg y plantillas a medida con ACF, llamadas a la API de GraphQL para algunos widgets interactivos, y un par de trucos más del mundo WordPress. Fue un reto divertido que combinó creatividad con ingeniería sólida.",
                    "image": {
                        "src": "./src/assets/website-uno.png",
                        "alt": "Sitio Web Uno",
                        "caption": "Este es un pie de imagen para el primer elemento."
                    }
                },
                {
                    "id": 2,
                    "title": "PalTech",
                    "description": "Desarrollé el sitio web de PalTech en WordPress, partiendo de diseños personalizados en PSD. Me entregaron maquetas muy bien elaboradas para cada página, y las transformé en módulos reutilizables para construir las plantillas reales. El proyecto no se trató solo de programar, sino de dar vida a un diseño elegante en un sitio funcional. Fue una experiencia divertida trabajar con un diseño tan bien pensado.",
                    "image": {
                        "src": "./src/assets/website-dos.png",
                        "alt": "Sitio Web Dos",
                        "caption": "Este es un pie de imagen para el segundo elemento."
                    }
                },
                {
                    "id": 3,
                    "title": "All Wheather",
                    "description": "<p>Este fue un proyecto desafiante que exigió un gran trabajo en equipo.</P><p>Mi responsabilidad principal fue construir la mayor parte del front-end, aunque también colaboré en algunas tareas de backend. Desarrollé plantillas personalizadas para distintos tipos de contenido usando ACF e integré librerías como jQuery y Masonry para lograr diseños dinámicos. Fue una excelente oportunidad para combinar funcionalidad con una experiencia de usuario fluida.</p>",
                    "url": "https://www.allweatheraa.com/",
                    "image": {
                        "src": "./src/assets/website-tres.png",
                        "alt": "Sitio Web de All Wheather",
                        "caption": "Este es un pie de imagen para el tercer elemento."
                    }
                }
            ]
        },
        "jobs": {
            "sectionTitle": "Experiencia",
            "content": [
                {
                    "id": 1,
                    "title": "Item One",
                    "description": "This is the first item in the list.",
                    "startYear": "2020",
                    "endYear": "2021",
                    "image": {
                        "src": "",
                        "alt": "",
                        "caption": ""
                    }
                },
                {
                    "id": 2,
                    "title": "Item Two",
                    "description": "This is the second item in the list.",
                    "startYear": "2020",
                    "endYear": "2021"
                },
                {
                    "id": 3,
                    "title": "Item Three",
                    "description": "This is the third item in the list.",
                    "startYear": "2020",
                    "endYear": "2021"
                }
            ]
        }
    },
    "skills": {
        "sectionTitle": "Skills",
        "content": [
            {
                "id": "skill1",
                "title": "HTML",
                "fontAwesomeName": "fab fa-html5"
            },
            {
                "id": "skill2",
                "title": "CSS",
                "fontAwesomeName": "fab fa-css3-alt"
            },
            {
                "id": "skill3",
                "title": "JavaScript",
                "fontAwesomeName": "fab fa-js"
            },
            {
                "id": "skill5",
                "title": "PHP",
                "fontAwesomeName": "fab fa-php"
            },
            {
                "id": "skill7",
                "title": "Git",
                "fontAwesomeName": "fab fa-git-alt"
            },
            {
                "id": "skill4",
                "title": "WordPress",
                "fontAwesomeName": "fab fa-wordpress"
            }
        ]
    },
    "social": {
        "sectionTitle": "Send a message",
        "content": [
            {
                "id": "social1",
                "name": "GitHub",
                "url": "https://github.com/laloptk",
                "fontAwesomeName": "fab fa-github"
            },
            {
                "id": "social2",
                "name": "LinkedIn",
                "url": "https://www.linkedin.com/in/eduardo-sanchez-hidalgo/",
                "fontAwesomeName": "fab fa-linkedin"
            }
        ]
    } 
}