{
    "en":{
        "title": "Hi! I'm, Eduardo. ",
        "subtitle": "I build websites.",
        "author": "Eduardo Sanchez Hidalgo Urias",
        "version": "1.0",
        "description": "<p>This is my portfolio website where you can see my experience as a <strong>WordPress developer</strong> and a few of the projects I worked on.</p>",
        "projects": {
            "sectionTitle": "Projects",
            "content": [
                {
                    "id": 1,
                    "title": "PartySlate",
                    "description": "PartySlate already had a blog, but they wanted a fresh look and a better experience for their content team — that’s where I came in. I helped them revamp their blog by integrating a brand-new WordPress setup with both their main website and their legacy blog (also on WordPress). The project involved building custom Gutenberg blocks and templates using ACF, implementing GraphQL API calls for interactive widgets, and playing with a few other neat WordPress tricks. It was a fun challenge that blended creativity with solid engineering.",
                    "image": {
                        "src": "./party-slate-blog-post-w-sidebar.png",
                        "alt": "A blog post by party slate",
                        "caption": "This is an image of one of the blog posts posted in party slate."
                    }
                },
                {
                    "id": 2,
                    "title": "KadenceWP",
                    "description": "<p>While working with StellarWP, I had the chance to contribute to Kadence — one of their branches offering a powerful WordPress theme and page builder (both free and pro versions).</p><p>My work focused on enhancing the Kadence ecosystem by fixing bugs and developing new features for Gutenberg blocks. I also worked with the WordPress Customizer, the Options API, and various internal tools. It was a hands-on experience that deepened my understanding of modern WordPress development.</p>",
                    "url": "https://www.kadencewp.com/",
                    "image": {
                        "src": "./kadence-plugin.png",
                        "alt": "KadenceWP Website",
                        "caption": "This is a caption for the second item."
                    }
                },
                {
                    "id": 3,
                    "title": "PalTech",
                    "description": "I built the PalTech website using WordPress, starting from their custom PSD designs. They handed me beautifully crafted layouts for every page, and I translated those into reusable modules to bring the templates to life. The project was not just about coding — it was about turning an elegant design into a fully functional site. It was genuinely fun to work on a build with such thoughtful design behind it.",
                    "image": {
                        "src": "./pal-tech-home.png",
                        "alt": "PalTech website's homepage",
                        "caption": "A screenshot of the PalTech website homepage"
                    }
                },
                {
                    "id": 4,
                    "title": "All Wheather",
                    "description": "<p>This was a challenging project that required strong teamwork.</p><p>I was primarily responsible for building most of the front end, while also contributing to some backend tasks. I developed custom templates for various post types using ACF, and integrated libraries like jQuery and Masonry to handle dynamic layouts. It was a great opportunity to blend functionality with a smooth user experience.</p>",
                    "image": {
                        "src": "./all-weather-home.png",
                        "alt": "All Wheather Website",
                        "caption": "The homepage of All Weather AA"
                    }
                }
            ]
        },
        "jobs": {
            "sectionTitle": "Experience",
            "content": [
                {
                    "id": "joben1",
                    "title": "StellarWP",
                    "position": "WordPress Developer",
                    "description": "<p>Contributed to the ongoing maintenance and feature development of multiple WordPress plugins across the company’s product suite.</p> <p>Specialized in Gutenberg block development, with a strong focus on the Kadence Theme, Kadence Blocks, and Kadence Blocks Pro.</p>",
                    "startYear": "2023",
                    "endYear": "2024",
                    "image": {
                        "src": "",
                        "alt": "",
                        "caption": ""
                    }
                },
                {
                    "id": "joben2",
                    "title": "Wizeline",
                    "description": "<p>I led the technical part of an audit of a large-scale Magento-based eCommerce platform to assess technical debt and identify improvement opportunities. Delivered a phased modernization plan, including patching legacy issues, introducing a React-based headless frontend, and outlining a long-term migration to microservices. The roadmap was approved and became the foundation for the company’s digital transformation strategy.</p>",
                    "startYear": "2022",
                    "endYear": "2023"
                },
                {
                    "id": "joben3",
                    "title": "RockStarCoders",
                    "description": "<p>Worked full-time as a contractor, serving marketing, SEO, and design-focused clients. Delivered tailored solutions including full site builds, plugin customization, performance optimization, and ongoing maintenance. Regularly worked with WordPress, ACF, Page Builders, REST API, and custom Gutenberg blocks. Often handled direct communication with clients, ensuring agile, client-first development.</p>",
                    "startYear": "2018",
                    "endYear": "2021"
                },
                {
                    "id": "joben4",
                    "title": "CabForward",
                    "description": "<p>Initially joined as a part-time contractor to implement the agency’s website redesign. After a few months, I was brought on full-time to help offer WordPress websites as a service to their clients. Most projects involved building custom sites using page builders like Divi and Cornerstone, with a focus on rapid delivery and solid UX.</p>",
                    "startYear": "2017",
                    "endYear": "2018"
                },
                {
                    "id": "joben5",
                    "title": "PostModernMarketing",
                    "description": "<p>Worked full-time as a contractor handling a wide variety of WordPress development tasks. From building custom templates for pages and post types to adding new functionality or styling existing components, I adapted to each project's needs with flexibility and precision. This role required strong knowledge of WordPress internals, frontend styling, and modular development practices.</p>",
                    "startYear": "2016",
                    "endYear": "2017"
                }
            ]
        }
    },
    "es": {
        "title": "¡Hola! Soy Eduardo.",
        "subtitle": "Construyo sitios web.",
        "author": "Eduardo Sánchez Hidalgo Urías",
        "version": "1.0",
        "description": "<p>Este es mi portafolio, donde puedes ver mi experiencia como <strong>desarrollador de WordPress</strong> y algunos de los proyectos en los que he trabajado.</p>",
        "projects":{ 
            "sectionTitle": "Proyectos",
            "content": [
                {
                    "id": "projectes1",
                    "title": "PartySlate",
                    "description": "<p>PartySlate ya tenía un blog, pero querían renovarlo y ofrecer una mejor experiencia a su equipo editorial — y ahí entré yo. Les ayudé a re-construir su blog desde cero, integrando una nueva instalación de WordPress con su sitio principal y su blog anterior (también en WordPress). El proyecto incluyó la creación de bloques personalizados de Gutenberg y plantillas a medida con ACF, llamadas a la API de GraphQL para algunos widgets interactivos, y un par de trucos más del mundo WordPress. Fue un reto divertido que combinó creatividad con ingeniería sólida.</p>",
                    "image": {
                        "src": "./party-slate-blog-post-w-sidebar.png",
                        "alt": "Sitio Web Uno",
                        "caption": "Este es un pie de imagen para el primer elemento."
                    }
                },
                                {
                    "id": "projectes2",
                    "title": "KadenceWP",
                    "description": "<p>Durante mi tiempo en StellarWP, tuve la oportunidad de colaborar con Kadence — una de sus divisiones que ofrece un potente tema y constructor de páginas para WordPress (en versiones gratuita y pro).</p><p>Mi trabajo se centró en mejorar el ecosistema de Kadence corrigiendo bugs y desarrollando nuevas funcionalidades para los bloques de Gutenberg. También trabajé con el Personalizador de WordPress, la Options API y otras herramientas internas. Fue una experiencia práctica que reforzó mis conocimientos en desarrollo moderno con WordPress.</p>",
                    "url": "https://www.kadencewp.com/",
                    "image": {
                        "src": "./kadence-plugin.png",
                        "alt": "Kadence theme",
                        "caption": "Foto del tema de WordPress Kadence"
                    }
                },
                {
                    "id": "projectes3",
                    "title": "PalTech",
                    "description": "Desarrollé el sitio web de PalTech en WordPress, partiendo de diseños personalizados en PSD. Me entregaron maquetas muy bien elaboradas para cada página, y las transformé en módulos reutilizables para construir las plantillas reales. El proyecto no se trató solo de programar, sino de dar vida a un diseño elegante en un sitio funcional. Fue una experiencia divertida trabajar con un diseño tan bien pensado.",
                    "image": {
                        "src": "./pal-tech-home.png",
                        "alt": "Sitio Web Dos",
                        "caption": "Este es un pie de imagen para el segundo elemento."
                    }
                },
                {
                    "id": "projectes4",
                    "title": "All Wheather",
                    "description": "<p>Este fue un proyecto desafiante que exigió un gran trabajo en equipo.</P><p>Mi responsabilidad principal fue construir la mayor parte del front-end, aunque también colaboré en algunas tareas de backend. Desarrollé plantillas personalizadas para distintos tipos de contenido usando ACF e integré librerías como jQuery y Masonry para lograr diseños dinámicos. Fue una excelente oportunidad para combinar funcionalidad con una experiencia de usuario fluida.</p>",
                    "url": "https://www.allweatheraa.com/",
                    "image": {
                        "src": "./all-weather-home.png",
                        "alt": "Sitio Web de All Wheather",
                        "caption": "Este es un pie de imagen para el tercer elemento."
                    }
                }
            ]
        },
        "jobs": {
            "sectionTitle": "Experiencia",
            "content": [
            {
                "id": "jobes1",
                "title": "StellarWP",
                "position": "Desarrollador WordPress",
                "description": "<p>Contribuí al mantenimiento continuo y desarrollo de nuevas funciones para varios plugins de WordPress dentro del portafolio de productos de la empresa.</p> <p>Especializado en el desarrollo de bloques Gutenberg, con un enfoque principal en Kadence Theme, Kadence Blocks y Kadence Blocks Pro. También trabajé con ACF, REST API, y Page Builders.</p>",
                "startYear": "2023",
                "endYear": "2024"
            },
            {
                "id": "jobes2",
                "title": "Wizeline",
                "position": "Ingeniero de Software",
                "description": "<p>Dirigí la parte técnica de una auditoría para una plataforma eCommerce basada en Magento con el objetivo de identificar deuda técnica y proponer una estrategia de modernización. Elaboré un plan por fases: primero corregir problemas existentes, luego desarrollar un frontend headless con React, y finalmente migrar el backend a microservicios. El plan fue aprobado y se convirtió en la hoja de ruta de transformación digital de la empresa.</p>",
                "startYear": "2022",
                "endYear": "2023"
            },
            {
                "id": "jobes3",
                "title": "RockStarCoders",
                "position": "Desarrollador WordPress (Contratista)",
                "description": "<p>Trabajé tiempo completo como contractor para una agencia que brindaba servicios a clientes enfocados en marketing, SEO y diseño. Desarrollé sitios completos, personalicé plugins, optimicé el rendimiento, di mantenimiento y a veces trabajé directamente con los clientes sin pasar por el project manager. Utilicé WordPress, ACF, Page Builders, REST API y bloques personalizados de Gutenberg.</p>",
                "startYear": "2018",
                "endYear": "2021"
            },
            {
                "id": "jobes4",
                "title": "CabForward",
                "position": "Desarrollador WordPress (Contratista)",
                "description": "<p>Inicié como contractor medio tiempo para implementar el rediseño del sitio web de la agencia. Meses después, me ofrecieron integrarme tiempo completo para desarrollar sitios WordPress para sus clientes. La mayoría de los sitios fueron creados con page builders como Divi y Cornerstone.</p>",
                "startYear": "2017",
                "endYear": "2018"
            },
            {
                "id": "jobes5",
                "title": "PostModernMarketing",
                "position": "Desarrollador WordPress (Contratista)",
                "description": "<p>Trabajé como contractor full-time haciendo un poco de todo: desde construir plantillas para páginas o post types, hasta añadir funcionalidades o estilos a componentes ya existentes. Este rol me exigía una comprensión sólida de WordPress, desarrollo modular, y buenas prácticas de frontend.</p>",
                "startYear": "2016",
                "endYear": "2017"
            }
        ]
    }
    },
    "skills": {
        "sectionTitle": "Skills",
        "content": [
            {
                "id": "skill1",
                "title": "HTML",
                "fontAwesomeName": "fab fa-html5"
            },
            {
                "id": "skill2",
                "title": "CSS",
                "fontAwesomeName": "fab fa-css3-alt"
            },
            {
                "id": "skill3",
                "title": "JavaScript",
                "fontAwesomeName": "fab fa-js"
            },
             {
                "id": "skill4",
                "title": "React",
                "fontAwesomeName": "fab fa-react"
            },
            {
                "id": "skill5",
                "title": "PHP",
                "fontAwesomeName": "fab fa-php"
            },
            {
                "id": "skill7",
                "title": "Git",
                "fontAwesomeName": "fab fa-git-alt"
            },
            {
                "id": "skill4",
                "title": "WordPress",
                "fontAwesomeName": "fab fa-wordpress"
            }
        ]
    },
    "social": {
        "sectionTitle": "Send a message",
        "content": [
            {
                "id": "social1",
                "name": "GitHub",
                "url": "https://github.com/laloptk",
                "fontAwesomeName": "fab fa-github"
            },
            {
                "id": "social2",
                "name": "LinkedIn",
                "url": "https://www.linkedin.com/in/eduardo-sanchez-hidalgo/",
                "fontAwesomeName": "fab fa-linkedin"
            }
        ]
    } 
}